Autodesk.Revit.DB.ExternallyTaggedNonBRep.SetUsage(Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage)
Controls the usage of this ExternallyTaggedNonBRep.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.ExternallyTaggedNonBRep.#ctor(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.GeometryObject)
Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with
a particular GeometryObject.
externalId:
The Id of the input geometry object.
geometry:
The externally tagged geometry object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
geometry must not be a Solid.
-or-
geometry must not have sub-nodes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExternallyTaggedNonBRep
This class is used to create an externally tagged geometry object.
Since:
2022